app/controllers/states_controller.rb

SELECT * FROM "states" WHERE (name LIKE '%%')
---
  def index
    @states = State.find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}%"])

SELECT * FROM "states" WHERE ("states"."id" = 1)
---
  def show
    logger.info("SHOW --> #{params[:id]} --> #{params[:id].class}")
    @state = State.find(params[:id])

SELECT * FROM "states" WHERE ("states"."name" = 'ALASKA') LIMIT 1
---
  def show_for_ac
    @state = State.find_by_name((params[:state])[:name])

INSERT INTO "states" ("name", "updated_at", "abbr", "created_at") VALUES('ALASKA', '2010-04-30 19:07:43', NULL, '2010-04-30 19:07:43')
---
  def create
    @state = State.new(params[:state])
    if @state.save

SELECT * FROM "states" WHERE ("states"."id" = 60)
---
  def edit
    logger.info("UPDATE --> #{params[:id]}")
    @state = State.find(params[:id])

SELECT * FROM "states" WHERE ("states"."id" = 60)
UPDATE "states" SET "abbr" = 'AL', "updated_at" = '2010-06-09 14:52:42' WHERE "id" = 60
---
  def update
    @state = State.find(params[:id])
    if @state.update_attributes(params[:state])